using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace test_1
{
    public class Program
    {
        static void Main(string[] args)
        {




            /**********************************************************************************************************************
             * 
             * Задание №1
             * 
             **********************************************************************************************************************/
            Console.WriteLine("Введите массив чисел через запятую");

            string str = Console.ReadLine();
            str = str.Replace(" ", "");
            int[] ar = str.Split(',').Select(int.Parse).ToArray();

            int tmp = 0;
            int tmp2 = 0;
            int tmp3 = 0;

            int maxValue = 0;
            int minValue = 10000;
            int maxArr = ar.Length;




            for (int s = 0; s < 100; s++)
            {

                for (int j = 1; j < ar.Length; j++)
                {
                    tmp = ar[j - 1];
                    tmp2 = ar[j];

                    if (tmp > maxValue)
                    {
                        maxValue = tmp;
                    };
                    if (tmp < minValue)
                    {
                        minValue = tmp;
                    };

                    if (tmp > tmp2)
                    {
                        tmp3 = tmp2;
                        ar[j] = tmp;
                        ar[j - 1] = tmp3;
                    }

                }

            }

            for (int i = 0; i < ar.Length; i++)
            {
                Console.WriteLine("i= " + i + " - " + ar[i]);
            }

            Console.WriteLine(minValue);
            Console.WriteLine(maxValue);

            /********************************************************************************************************************
             * 
             * Конец кода
             * 
             *******************************************************************************************************************/



             /**********************************************************************************************************************
             * 
             * Задание №2
             * 
             **********************************************************************************************************************/

            Console.WriteLine("Введите число, которое хотите найти:");
            int searc = int.Parse(Console.ReadLine());

            for (int i = 0; i < ar.Length; i++)
            {
                if (searc == ar[i])
                {
                    Console.WriteLine("Найден под индексом: " + i);
                }
            }

             /**********************************************************************************************************************
             * 
             * Конец кода
             * 
             **********************************************************************************************************************/

             /**********************************************************************************************************************
             * 
             * Задание №3
             * 
             **********************************************************************************************************************/

            Console.WriteLine("Введите предложение: ");

            string str_2 = Console.ReadLine();

            string[] arrSTR = str_2.Split(' ');
            //Console.WriteLine(arrSTR.Length);



            for (int i = 0; i < arrSTR.Length; i++)
            {
                int s = 0;
                string temp_i = arrSTR[i];

                //Console.WriteLine("i= " + i + arrSTR[i]);
                for (int k = 0; k < arrSTR.Length; k++)
                {
                    //Console.WriteLine("k= " + k + arrSTR[k]);

                    string temp_k = arrSTR[k];
                    if (temp_i == temp_k)
                    {
                        s++;
                    }
                }
                if (s <= 1)
                {
                    Console.WriteLine("Найдены уникальные слова: " + arrSTR[i]);
                }
            }


             /**********************************************************************************************************************
             * 
             * Конец кода
             * 
             **********************************************************************************************************************/


             /**********************************************************************************************************************
             * 
             * Задание №4
             * 
             **********************************************************************************************************************/



            Console.WriteLine("Введити число для нахождения его факториала: ");
            int n = int.Parse(Console.ReadLine());
            int[] counter_n = new int[n];
            long counter_all = 1;

            for (int i = 0; i < n; i++)
            {
                counter_n[i] = i + 1;
                //Console.WriteLine("i= " + i + " " + counter_n[i]);
            }


            for (int i = 0; i < counter_n.Length; ++i)
            {
                counter_all = counter_all * counter_n[i];
                //Console.WriteLine("counter_all= " + counter_all + " " + "counter_n= " + counter_n[i]);
            }

            Console.WriteLine("n!= " + counter_all);

             /**********************************************************************************************************************
             * 
             * Конец кода
             * 
             **********************************************************************************************************************/



             /**********************************************************************************************************************
             * 
             * Задание №5
             * 
             **********************************************************************************************************************/






           
            Console.WriteLine("Haжмитe <Enter> для выхода . . . ");
            Console.Read();
        }
    }
}
